InformationRegisters/ОчередьВыгрузкиPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьВыгрузкиPDM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйПараметр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗавершенОбмен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанныеВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикДействий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбменаPDM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОбменаPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОбменаPDM</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзывПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносФайла</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодключениеКВнешнейБазе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбменаPDM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменСPDM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ом_PDM_API_Сервер/Ext/Module.bsl
Функция ПоставитьЗадачуВОчередьPDM_API(ТипыОбменаPDM, СтруктураПараметров) Экспорт
	 
    Если ТипыОбменаPDM = Перечисления.ТипыОбменаPDM.ПереносФайла Тогда
		Возврат ПоставитьВОчередьПереносФайла(СтруктураПараметров);
	Иначе
	
		
	
	КонецЕсли;
	
	Возврат "";

КонецФункции


Функция ПоставитьВОчередьПереносФайла(СтруктураПараметров) //СтруктураПараметров это структура 
	//"ОбъектВыгрузки 	- Объект выгрузки
	//"АдресХранилища 	- адрес во временном хранилище
	//"ИмяФайла" 		- имя файла в PDM с расширением
	//"ПутьКФайлу" 		- Путь к файлу в структуре PDM
	
	НаименованиеОшибки 	= "Перенос файла";
	КодОшибки				= "";
	ПроизвольноеОписание	= "";
	
	УИД = Строка(Новый УникальныйИдентификатор());
	
	Попытка
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресХранилища);
		ПутьКФайлу = КаталогВременныхФайлов() + УИД;
		
	Исключение
		КодОшибки 				= "00001";
		ПроизвольноеОписание 	= ОписаниеОшибки();
	КонецПопытки;
	
	//Если ПустаяСтрока(КодОшибки) Тогда
	//	
	//	Попытка
	//		COMОбъектPDM_1C_COM = омPDMНаСервереПовтор.ПодключитьБиблиотекуPDM();	
	//	Исключение
	//		КодОшибки 				= "00002";
	//		ПроизвольноеОписание 	= ОписаниеОшибки();
	//	КонецПопытки;
	//	
	//	Если COMОбъектPDM_1C_COM = Неопределено Тогда
	//	
	//		КодОшибки 				= "00003";
	//		ПроизвольноеОписание 	= "Ошибка получении PDM_1C_COM";
	//	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Если ПустаяСтрока(КодОшибки) Тогда
		
		МенеджерЗаписи 							= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Автор					= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДатаОчередь 				= ТекущаяДата();
		МенеджерЗаписи.ДополнительныйПараметр 	= СтруктураПараметров.ИмяФайла; //Имя временного файла
		МенеджерЗаписи.ДополнительныйПараметр 	= СтруктураПараметров.ПутьКФайлу; //Имя временного файла
		МенеджерЗаписи.ОбъектВыгрузки 			= СтруктураПараметров.ОбъектВыгрузки;
        МенеджерЗаписи.ТипОбмена 				= Перечисления.ТипыОбменаPDM.ПереносФайла;
		МенеджерЗаписи.УИД 						= УИД;
		
		МенеджерЗаписи.Записать();
			
	Иначе
		
		омЖурналСобытий.ЗаписатьВЖурналСобытий(2,"ом_PDM_API_Сервер.ПоставитьВОчередьПереносФайла"
			,омЖурналСобытий.ЗаполнитьПараметрыЖурналаСобытий(НаименованиеОшибки, КодОшибки)
			,ПроизвольноеОписание
			,Перечисления.СтатусСобытий.Ошибка
			,Перечисления.ТипыСобытий.ОшибкаОбменаPDM);
		
	КонецЕсли;
	
	
КонецФункции // ПоставитьВОчередьПереносФайла(СтруктураПараметров)
